<a href="https://colab.research.google.com/github/sekoukeita/pandas_exercises/blob/master/Untitled0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
data = pd.DataFrame({'Name': ['Sekou keita', 'Traore Sayon'], 'Age': [39,29]})

In [0]:
data['First Name'] = data['Name'].str.split(n=1).str[0]
data['Last Name'] = data['Name'].str.split(n=1).str[1]

In [23]:
data

           Name  Age First Name Last Name
0   Sekou keita   39      Sekou     keita
1  Traore Sayon   29     Traore     Sayon

In [24]:
age = data['Age']
data.drop('Age',axis=1,inplace=True)
data['Age'] = age
data

           Name First Name Last Name  Age
0   Sekou keita      Sekou     keita   39
1  Traore Sayon     Traore     Sayon   29

In [0]:
data.replace(to_replace=39,value=50,inplace=True)

In [27]:
data

           Name First Name Last Name  Age
0   Sekou keita      Sekou     keita   50
1  Traore Sayon     Traore     Sayon   29

In [0]:
data.